
address_list = {
    "가로수길":["신사동"], 
    "강남역":["역삼동", "서초동"],
    # "건대":["건대입구"],
    "경리단길":["이태원동"],
    "광화문":["가회동", "종로동", "사직동", "견지동", "세종로", "효자동", "창성동", "통의동", "도렴동", "당주동", "신문로1가", "내수동", "내자동", "체부동", "통인동", "원서동", "관훈동", "팔판동", "안국동", "계동", "소격동", "재동", "중학동", "수송동", "견지동", "공평동"],
    # "남양주":[""],
    # "대학로":["혜화"],
    # "망원":["망원동"],
    # "명동":["명동역"],
    # "문래":["문래역"],
    # "북촌":["경복궁역"],
    # "분당":["서현역"],
    # "상수":["상수동"],
    # "샤로수길":["서울대입구역"],
    # "서래마을":[""],
    # "서촌":[""],
    "성수":["성수동"],
    # "송도":[""],
    "압구정":["압구정동"],
    # "양재":[""],
    # "양평":[""],
    # "여의도":[""],
    # "연남":[""],
    # "을지로":[""],
    # "이태원":[""],
    # "익선동":[""],
    # "인사동":[""],
    # "일산":[""],
    # "잠실":[""],
    # "종로":[""],
    "청담동":["청담동"],
    # "한남동":[""],
    # "합정":[""],
    # "해방촌":[""],
    "홍대":["서교동", "상수동", "창천동"]
}



def get_area_from_address(address):
    if not address:
        return None
    for area in address_list:
        for dong in address_list[area]:
            if dong in address:
                return area
    return None


if __name__ == "__main__":
    area = get_area_from_address("서울시 청담동")
    print(area)