'''
식당 리스트
https://data.seoul.go.kr/dataList/datasetView.do?infId=OA-10741&srvType=S&serviceKind=1&currentPageNo=1
'''
address_list = {
    ##"가로수길":["신사동"], 
    ##"강남역":["역삼동", "서초동"],
    "건대":["화양동", "자양동"], #광진구
    ##"경리단길":["이태원동"],
    ##"광화문":["가회동", "종로동", "사직동", "견지동", "세종로", "효자동", "창성동", "통의동", "도렴동", "당주동", "신문로1가", "내수동", "내자동", "체부동", "통인동", "원서동", "관훈동", "팔판동", "안국동", "계동", "소격동", "재동", "중학동", "수송동", "견지동", "공평동"],
    # "남양주":[""],
    "대학로":["동숭동", "연건동", "이화동", "효제동", "명륜2가", "명륜4가", ], #종로구
    "망원":["망원동"],#마포구
    "명동":["명동"],  #중구
    "문래":["문래동"], #영등포구
    "북촌":["삼청동", "가회동", "팔판동", "소격동", "화동"],
    # "분당":["서현역"],
    "상수":["상수동"], #마포구
    "샤로수길":["봉천동","낙성대동"], #관악구
    "서래마을":["반포동"], #서초구
    "서촌":["내자동", "적선동", "효자동", "청운효자동", "청운동", "필운동", "통의동", "체부동", "누하동", "창성동", "내수동"], #종로구
    ##"성수":["성수동"],
    # "송도":[""],
    ##"압구정":["압구정동"],
    "양재":["양재동", "양재1동", "양재2동", "도곡동", "서초동"], #강남구, #서초구
    # "양평":[""],
    "여의도":["여의도동"], #영등포구
    "연남":["연남동"], #마포구
    "을지로":["을지로동", "광희동", "명동"], #중구
    "이태원":["이태원동", "한남동"], #용산구
    "익선동":[""], #종로구
    "인사동":["인사동", "관훈동", "견지동", "계동", "재동", "경운동"], #종로구
    # "일산":[""],
    "잠실":["잠실동"], #송파구
    "종로":["관철동", "서린동", "인사동"], #종로구"
    ##"청담동":["청담동"],
    "한남동":["한남동"], #용산구
    "합정":["합정동", "서교동"],
    "해방촌":["이태원동", "용산동"], #용산구
    ##"홍대":["서교동", "상수동", "창천동"]
}



def get_area_from_address(address):
    areas = [] #하나의 동이 여러개의 area에 포함될 수 있으므로
    if not address:
        return None
    for area in address_list:
        for dong in address_list[area]:
            if dong in address:
                areas.append(area)
                # return area
    if len(areas) > 0:
        return areas
    return None


if __name__ == "__main__":
    area = get_area_from_address("서울시 청담동")
    print(area)