import chardet
area_list = [
        "가로수길", 
        "강남역",
        "건대",
        "경리단길",
        
        # "남양주",
        "대학로",
        "망원",
        "명동",
        "문래",
        "북촌",
        # "분당",
        "상수",
        "샤로수길",
        "서래마을",
        "서촌",
        "성수",
        # "송도",
        "압구정",
        "양재",
        # "양평",
        ## "여의도",
        "연남",
        "을지로",
        "이태원",
        "익선동",
        "인사동",
        # "일산",
        # "잠실",
        # "종로",
        "청담동",
        # "한남동",
        # "합정",
        # "해방촌",
        "홍대",
        # "광화문"
]

# Query 입력에서 mapping 해주는 거
query_list = {
        "가로수길":["신사동","신사"], 
        "강남역":["강남","신논현", "신논현역", "역삼"],
        "건대":["건대입구", "건국대", "건대입구역"],
        "경리단길":["경리단"],
        "광화문":["광화문역"],
        # "남양주":[""],
        "대학로":["혜화", "혜화역", "성신여대", "성신여대역"],
        "망원":["망원동"],
        "명동":["명동역"],
        "문래":["문래역"],
        "북촌":["안국역"],
        # "분당":["서현역"],
        "상수":["상수동"],
        "샤로수길":["서울대입구역", "낙성대", "서울대"],
        "서래마을":["방배동", "고속터미널", "고터"],
        "서촌":["삼청동", "경복궁역"],
        "성수":["성수동","성수역","서울숲","서울숲역","뚝섬","뚝섬역"],
        # "송도":[""],
        "압구정":["압구정역", "압구정로데오역", "압로", "압구정로데오", "압구정동", "도산공원"],
        "양재":["양재역", "서초동", "도곡동"],
        # "양평":[""],
        "여의도":["여의도역", "여의도동", "국회의사당역", "국회의사당"],
        "연남":["연남동"],
        "을지로":["을지로입구역"],
        "이태원":["이태원역", "녹사평역", "이태원동"],
        "익선동":["익선"],
        "인사동":[],
        # "일산":[""],
        "잠실":["잠실동", "신천", "롯데월드", "잠실역", "잠실새내", "잠실새내역"],
        "종로":["종각역"],
        "청담동":["청담", "청담역", "강남구청", "강남구청역"],
        "한남동":["한남", "옥수", "한남역", "옥수역"],
        "합정":["합정동", "합정역"],
        "해방촌":["해방촌"],
        "홍대":["홍대역", "홍대입구역", "홍익대학교", "홍대입구"]
    }

tag_list = {
    "가로수길":["신사동맛집", "가로수길맛집","신사역맛집", "신사맛집"], 
    "강남역":["강남역맛집","신논현맛집", "신논현역맛집", "강남맛집", "역삼동맛집", "서초동맛집", "역삼맛집", "서초맛집"],
    "건대":["건대입구맛집","건대맛집","건대입구역맛집","건대역맛집","건국대학교맛집"],
    "경리단길":["경리단길맛집","경리단맛집", "녹사평역맛집", "녹사평맛집", "이태원맛집"],
    "광화문":["광화문맛집", "광화문역맛집", "경복궁맛집", "경복궁역맛집", "세종문화회관맛집"],
    # "남양주":[""],
    "대학로":["혜화맛집", "대학로맛집", "성신여대맛집"],
    "망원":["망원동맛집", "망원맛집"],
    "명동":["명동역", "명동역맛집", "명동맛집"],
    "문래":["문래맛집", "문래역맛집"],
    "북촌":["경복궁역맛집", "경복궁맛집", "북촌맛집", "안국역맛집", "안국맛집"],
    # "분당":["서현역"],
    "상수":["상수동맛집","상수맛집"],
    "샤로수길":["서울대입구역맛집","샤로수길맛집", "낙성대맛집", "낙성대역맛집", "서울대맛집"],
    "서래마을":["서래마을맛집"],
    "서촌":["서촌맛집", "경복궁역맛집", "경복궁맛집"],
    "성수":["서울숲맛집", "성수맛집", "뚝섬맛집", "서울숲역맛집", "성수역맛집", "뚝섬역맛집", "성수동맛집"],
    # "송도":[""],
    "압구정":["압구정맛집","압구정역맛집","압구정로데오맛집"],
    "양재":["양재맛집", "양재동맛집"],
    # "양평":[""],
    "여의도":["여의도맛집", "여의도역맛집", "국회의사당맛집", "국회의사당역맛집"],
    "연남":["연남맛집", "연남동맛집"],
    "을지로":["을지로맛집", "을지로입구역맛집", "을지로역맛집"],
    "이태원":["이태원맛집", "녹사평맛집", "이태원역맛집", "녹사평역맛집"],
    "익선동":["익선동맛집", "익선맛집"],
    "인사동":["인사동맛집", "안국역맛집"],
    # "일산":[""],
    "잠실":["잠실맛집", "신천맛집", "잠실역맛집", "신천역맛집", "잠실새내맛집", "잠실새내역맛집"],
    "종로":["종로맛집", "종각역맛집", "종각맛집"],
    "청담동":["청담동맛집","청담역맛집","청담맛집", "강남구청맛집", "강남구청역맛집"],
    "한남동":["한남동맛집", "한남맛집"],
    "합정":["합정맛집", "합정역맛집"],
    "해방촌":["해방촌맛집"],
    "홍대":["홍대맛집","홍대입구맛집","홍익대학교맛집", "홍대입구역맛집"]
}

def map_query_to_venue(query):
    if query in query_list:
        return query
    for k in query_list.keys():
        if query in query_list[k]:
            return k
    return None

def map_tag_to_area(tag):
    if tag in tag_list:
        return tag
    for k in tag_list.keys():
        if tag in tag_list[k]:
            return k
    return None

def get_tags_per_area(area_name):
    if area_name not in tag_list:
        print("No such area. Check the area name.")
        return None
    return tag_list[area_name]

def validate_area_name(area_name):
    if area_name in area_name:
        return True
    return False


def get_search_list(area_name):
    if area_name in area_list:
        return search_list[area_name]
    return None


if __name__ == "__main__":
    # map_query_to_venue("서울숲맛집")
    print(chardet.detect(area_list[1]))